In [2]:
import pandas as pd
import numpy as np

In [4]:
datos = {'Name': ['David', 'Juan', 'John', 'Eliza'],
         'Grade': [100, 89, 67, 95], 'Sport': ['Soccer', 'Baseball', 'Rugby', 'Basketball']}
df = pd.DataFrame(datos)
df

   Grade   Name       Sport
0    100  David      Soccer
1     89   Juan    Baseball
2     67   John       Rugby
3     95  Eliza  Basketball

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
Grade    4 non-null int64
Name     4 non-null object
Sport    4 non-null object
dtypes: int64(1), object(2)
memory usage: 176.0+ bytes

In [8]:
datos2 = {'Name': [None, 'David', 'Juan', 'Eliza'],
         'Grade': [100, 89, np.nan, 95], 'Sport': ['Soccer', None, 'Baseball', 'Basketball']}
df2 = pd.DataFrame(datos2)
df2

   Grade   Name       Sport
0  100.0   None      Soccer
1   89.0  David        None
2    NaN   Juan    Baseball
3   95.0  Eliza  Basketball

In [9]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
Grade    3 non-null float64
Name     3 non-null object
Sport    3 non-null object
dtypes: float64(1), object(2)
memory usage: 176.0+ bytes

In [10]:
df2.describe()

            Grade
count    3.000000
mean    94.666667
std      5.507571
min     89.000000
25%     92.000000
50%     95.000000
75%     97.500000
max    100.000000

In [12]:
df2.dropna().set_index('Name')

       Grade       Sport
Name
Eliza   95.0  Basketball

In [17]:
new_df = df2.copy()
new_df

   Grade   Name       Sport
0  100.0   None      Soccer
1   89.0  David        None
2    NaN   Juan    Baseball
3   95.0  Eliza  Basketball

In [19]:
new_df['Grade'] = new_df['Grade'].replace(np.nan, 0)
new_df

   Grade   Name       Sport
0  100.0   None      Soccer
1   89.0  David        None
2    0.0   Juan    Baseball
3   95.0  Eliza  Basketball

In [20]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
Grade    4 non-null float64
Name     3 non-null object
Sport    3 non-null object
dtypes: float64(1), object(2)
memory usage: 176.0+ bytes

In [22]:
new_df['Sport'].describe()

count          3
unique         3
top       Soccer
freq           1
Name: Sport, dtype: object

In [43]:
new_df2 = df2.copy()
new_df2

   Grade   Name       Sport
0  100.0   None      Soccer
1   89.0  David        None
2    NaN   Juan    Baseball
3   95.0  Eliza  Basketball

In [60]:
new_df3 = df2.copy()
new_df3

   Grade   Name       Sport
0  100.0   None      Soccer
1   89.0  David        None
2    NaN   Juan    Baseball
3   95.0  Eliza  Basketball

In [61]:
new_df3 = new_df3.dropna()
new_df3

   Grade   Name       Sport
3   95.0  Eliza  Basketball

In [63]:
df4 = df2.copy()
df4.describe()

            Grade
count    3.000000
mean    94.666667
std      5.507571
min     89.000000
25%     92.000000
50%     95.000000
75%     97.500000
max    100.000000

In [64]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
Grade    3 non-null float64
Name     3 non-null object
Sport    3 non-null object
dtypes: float64(1), object(2)
memory usage: 176.0+ bytes

In [66]:
df4['Name'].value_counts()

David    1
Eliza    1
Juan     1
Name: Name, dtype: int64

In [67]:
df4['Name'].unique()

array([None, 'David', 'Juan', 'Eliza'], dtype=object)

In [71]:
df4['Name'].isnull()

0     True
1    False
2    False
3    False
Name: Name, dtype: bool

In [72]:
df4['Sport'].isnull()

0    False
1     True
2    False
3    False
Name: Sport, dtype: bool

In [75]:
df4['Grade'].astype(str)

0    100.0
1     89.0
2      nan
3     95.0
Name: Grade, dtype: object

In [77]:
df4['Grade']

0    100.0
1     89.0
2      NaN
3     95.0
Name: Grade, dtype: float64

In [80]:
df2.mean()

Grade    94.666667
dtype: float64